In [1]:
import pandas as pd

In [2]:
#2 задание
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [19]:
df_country = power[(power['country'].str.contains('Lat', case=False)) | (power['country'].str.contains('Lit', case=False)) | (power['country'].str.contains('Estonia', case=False))]

In [21]:
df_category = df_country[df_country['category'].isin([4,12,21])]

In [24]:
df_year = df_category[(df_category['year'] >= 2005) & (df_category['year'] <= 2010) & (df_category['quantity'] > 0)]

In [27]:
df_year['quantity'].sum()

240580.0

In [6]:
#1 задание
movies = pd.read_csv('ml-latest-small/ratings.csv')
movies.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [7]:
movies[movies['rating'] == 5]['movieId'].sort_values()

5555          1
9157          1
23864         1
32052         1
11728         1
          ...
46620    187593
37419    187593
15246    187593
90255    187595
71996    187717
Name: movieId, Length: 13211, dtype: int64

In [8]:
movies['movieId'].nunique()

9724

In [28]:
#3 задание
pd.read_html('https://fortrader.org/quotes/ruble')[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  86.23      -0.16         -0.19        NaN
1       USDRUB Курс рубля к доллару  72.85      -0.29         -0.39        NaN